app/views/songs/show.html.erb


<% @song.artist.each do |artist| %>
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 24]]